/**
 * Типові помилки
 *
 * - Звернення до змінної до її оголошення
 * - Перевизначення значення для змінної оголошеної через const
 * - Обращение по неправильному імени змінної
 *
 */

//!======================================================

// let x;

// console.log(x);

// x = 25;

// console.log(x);

// x = null;

// console.log(x);

//!======================================================

// const username = 'Mango';

// let age = 20;

// const price = 200;

// const x = 10;

// x = 'Hello';
//!======================================================

// const userAge = 10;

// console.log(userAge);
